src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеУдалить</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийХранилищеЗначений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетДляКлиентаПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Маркер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Проекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьМаркерПриИзменении(Элемент)
	
	Элементы.ГруппаМаркер.Видимость = Объект.ИспользоватьМаркер;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	
	// шаблон: ТекущаяДата + "_" + Клиент + "_" + Название проекта
	Объект.Наименование = Строка(Формат(ТекущаяДата(), "ДЛФ=D")) + "_" + Строка(Объект.Клиент) + "_";
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТехническоеЗадание(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СформироватьМаркерНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект.Клиент) Тогда
		Объект.Маркер = Строка(Объект.Контрагент.ПрефиксМаркеровки) + "_" + Строка(Объект.Клиент.ПрефиксМаркеровки) + "_";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьМаркер(Команда)
	
	СформироватьМаркерНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаМаркер.Видимость = Объект.ИспользоватьМаркер;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ОтчетДляКлиентаПоПлану = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КомментарийПроекта = ТекущийОбъект.КомментарийХранилищеЗначений.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.КомментарийХранилищеЗначений = Новый ХранилищеЗначения(КомментарийПроекта);
	
КонецПроцедуры

#КонецОбласти
